Основные_объекты_Занятие_6/src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставитьСкидку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.Серии</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Основные_объекты_Занятие_6/src/InformationRegisters/НашиЦены/НашиЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НашиЦены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_Занятие_6/src/InformationRegisters/СкидкиКонтрагентам/СкидкиКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиКонтрагентам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_Занятие_6/src/Documents/Реализация/Forms/ФормаДокумента/Module.bsl
//ДЗ 1.5.4---------------------начало
&НаСервереБезКонтекста
Процедура АктуальнаяЦенаНаСервере(Номенклатура, Контрагент, Период, Цена = 0)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.НашиЦены.СрезПоследних(
	|			&Период,
	|			Номенклатура = &Номенклатура
	|				И Контрагент = &Контрагент) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Цена = ВыборкаДетальныеЗаписи.Цена;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АктуальнаяЦена(Команда)
	
	//ДЗ 1.5.4
	
	Перем Цена;
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	
	АктуальнаяЦенаНаСервере(ТекДанные.Номенклатура, Объект.Контрагент, Объект.Дата, Цена);
	
	ПоказатьПредупреждение(,
	"Актуальная цена на номенклатуру """ + ТекДанные.Номенклатура
	+ """ для контрагента """ + Объект.Контрагент + """ составляет " + Цена + " руб. за 1 ед."
	,15, "Информация об актеальной цене");
	
КонецПроцедуры
//ДЗ 1.5.4---------------------конец


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредоставитьСкидкуПриИзмененииНаСервере();
	
КонецПроцедуры

//ДЗ 1.5.5-----------------------начало
&НаКлиенте
Процедура ПредоставитьСкидкуПриИзменении(Элемент)
	
	ПредоставитьСкидкуПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПредоставитьСкидкуПриИзмененииНаСервере()

	Если Объект.ПредоставитьСкидку Тогда
		
		Элементы.ТекстСообщения.Видимость = Истина;

		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкидкиКонтрагентамСрезПоследних.Скидка
		|ИЗ
		|	РегистрСведений.СкидкиКонтрагентам.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК СкидкиКонтрагентамСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() тогда

			Скидка = ВыборкаДетальныеЗаписи.Скидка;
			
			Если Скидка > 0 Тогда
				ТекстСообщения = "Для контрагента """ + Объект.Контрагент + """ будет предоставлена скидка " + Скидка + "%";
			Иначе	
				ТекстСообщения = "Для контрагента """ + Объект.Контрагент + """ будет установлена наценка " + (-1*Скидка) + "%";
			КонецЕсли;
			
		Иначе
			
				ТекстСообщения = "Для контрагента """ + Объект.Контрагент + """ информации о скидках / наценках не указана.";
			
		КонецЕсли;
	

	Иначе	
		
		Элементы.ТекстСообщения.Видимость = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры
//ДЗ 1.5.5-----------------------конец
